"use strict";
// Створити змінну з іменем name і присвоїти їй значення свого імені. Вивести значення цієї змінної в консоль.
const name = "Gosha";

console.log(name);

// Створити змінну з іменем age і присвоїти їй значення свого віку. Вивести значення цієї змінної в консоль.
let age = "17";

console.log(age);

// Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом.
const isStudent = true;

console.log(isStudent);

// Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою. // Вивести цей рядок в консоль.
const myString = "Світ ловив мене, але не спіймав";

// Створити змінну з іменем myNumber і присвоїти їй довільне числове значення. Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.
let myNumber = 10;

myNumber = myNumber + 10;

console.log(myNumber);

// Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.
const myNull = null;

console.log(myNull);

// Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt(). Після введення імені вивести повідомлення привітання з використанням введеного імені.s
const userName = prompt("Як тебе звати?", "");

alert("Привіт, " + userName + "! Ласкаво просимо!");

// Створити скрипт який виводить спливаюче підтвердження за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".
let accept = confirm("Просимо Вас пітвердити дію");
if (accept) {
  alert("Дякую за підтвердження!");
} else {
  alert("Дію відмінено!");
}

// Створити скрипт який виводить спливаюче попередження за допомогою alert(). Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".
alert("Ми помітили небезпечні паки на цьому сайті!");
let question = confirm("Дія небезпечна, ви впевнені, що бажаєте продовжити?");
if (question) {
  alert("Дякую за підтвердження!");
} else {
  alert("Дію відмінено!");
}
