"use strict";
// Напишіть скрипт для створення випадкового числа з плаваючою крапкою від min до max (не враховуючи max).
const low = 1;
const high = 9;
console.log(Math.random() * (high - low) + low);

//  Створіть функцію яка генерує випадкове ціле число від min до max включно.
const min = 1;
const max = 10;
console.log(Math.random() * (max - min + 1) + min);

//  Напишіть скрипт, який просить відвідувача ввести два числа, і в результаті показує їх суму.
let y = prompt("Введіть перше число:");
let x = prompt("Введіть друге число:");
var sum = y + x;
alert;
"Сума чисел " +
  parseInt(y) +
  " і " +
  parseInt(x) +
  " дорівнює: " +
  parseInt(sum);
//   Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.
let c = 36.6;
let f = (c * 9) / 5 + 32;
console.log(f);
//   Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
const december = 31;
const hours = december * 24;
const minutes = hours * 60;
console.log(minutes, hours, december);

//   Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
let healthy = 100;
let energy = 100;
let hungry = 24;
let exhaustion = 60;
console.log(healthy - hungry, energy - exhaustion);
//   Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.
let price = 1350;
let sale = 10;
console.log(price - price / sale);
//   Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.
const i = 12.674524;
console.log(Math.floor(i));
//   Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.
const k = "123.1231avacadoplayer123";
console.log(parseFloat(k));
//   Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.
const o = "123.1231avacadoplayer123";
console.log(parseInt(o));
//   Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.
const q = 64;
console.log(Math.sqrt(q));
//   Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль. Потім використати метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль.
const simpleNumber = 42;
const stringNumber = "123";
const fixStringNumber = parseInt(stringNumber);
console.log(fixStringNumber);
const fixSimpleNumner = toString(simpleNumber);
console.log(fixSimpleNumner);
