"use strict";

// Конструкція switch може замінити кілька if.

// Вона дає можливість більш наочного способу порівняння значення відразу з кількома варіантами.

// І if/else ifоператори, і switch оператор є структурами потоку керування в JavaScript, які використовуються для прийняття рішень на основі різних умов. Хоча вони служать подібним цілям, вони мають різні варіанти використання та переваги:

// Гнучкість : if/else if оператори є більш гнучкими та можуть працювати з широким діапазоном умов. Вони дозволяють перевіряти складні умови за допомогою різноманітних операторів порівняння (наприклад, ===, >, <тощо), логічних операторів ( &&, ||, !) і спеціальних функцій. Ви також можете вкладати if/else оператори, щоб створювати більш складні процеси прийняття рішень.
// Порівняння : це switch твердження в основному використовується для простих порівнянь на основі цінностей. Він обчислює вираз один раз, а потім порівнює отримане значення з кількома реченнями case. Він не підтримує складні умови чи діапазони значень у кожному випадку.
// Читабельність : switch оператор може зробити код більш читабельним і організованим під час обробки серії рівностей щодо однієї змінної. Це особливо корисно при роботі з великою кількістю справ.
// Продуктивність : у деяких випадках switch оператор може бути швидшим, ніж довгі ланцюжки if/else if операторів, коли є кілька випадків і можна знайти пряму відповідність без необхідності оцінювати кожну умову.

// Використовуйте if/else if оператори, коли вам потрібно перевірити складні умови або оцінити кілька умов у певному порядку.
// Використовуйте цей switch оператор, коли у вас є просте порівняння на основі значення з кількома випадками, і кожен випадок прямо збігається з однією змінною.

// Інструкції Switch не можуть включати порівняння. Наприклад, перевірити, чи одна змінна є істинною, а інша – хибною, чи одне число більше іншого.

// Перемикачі призначені для перевірки однієї змінної, яка може бути в одному з багатьох станів.
//! suntacsis
// switch(x){
//     case 'value1':
//       ...
//     break;
//     case 'value2':
//         ...
//         break;
//         default:
//             ...
//             break;

// // !example
// const a = 2 + 2;
// switch (a) {
//   case 3:
//     console.log("false");
//     break;
//   case 4:
//     console.log("true");
//     break;
//   case 5:
//     console.log("false");
//     break;
//   default:
//     console.log("idk");
//     break;
// }
// const b = 3;
// switch (b) {
//   case 4:
//     console.log("right");
//     break;
//   case 3:
//   case 5:
//     console.log("false, try again.");
//     break;
//   default:
//     console.log("Result is strange");
//     break;
// }

// //! Тип має значення
// const arg = "0";
// switch (arg) {
//   case "0":
//   case "1":
//     console.log("one or zero");
//     break;
//   case "2":
//     console.log("two ");
//     break;
//   case 3:
//     console.log("three");
//     break;
//   default:
//     console.log("unsuall number");
//     break;
// }
// Напиши скрипт вибору опції доОпція зберігається ставки товару. в змінній option: 1 - самовивіз, 2 - кур"єр, 3 - пошта. В змінну message записати повідомлення в залежності від опції.
// - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
// - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
// - 'Посилка буде відправлена сьогодні'
// - 'Вам передзвонит менеджер'.
// const option = +prompt("choose option:  1 - самовивіз, 2 - курєр, 3 - пошта.");
// let massage;
// switch (option) {
//   case 1:
//     massage = "Ви зможете забрати товар завтра з 12:00 в нашому офісі";
//     break;
//   case 2:
//     massage = 'Кур"єр доставить замовлення завтра з 9:00 до 18:00';
//     break;
//   case 3:
//     massage = "Посилка буде відправлена сьогодні";
//     break;
//   default:
//     massage = "Вам передзвонит менеджер";
//     break;
// }
// alert(massage);
// Якщо ваше ім’я містить більше 4 букв і прізвище більше 5, то виведіть на екран число,яке дкщо умова не виорівнює сумі букв імені і прізвища. Яконується - вивести “УПС”. Наприклад: “Віктор Сташко” Віктор - 6 літер, Сташко - 6 літер. Виводимо 12. Використовувати вбудований метод length.

// Напиши скрипт вибору готеля по кількості зірок.
// 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
// Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
// "Токої кількості зірок немає";
let stars = +prompt("Write how much stars do you want?");

let cost;

switch (stars) {
  case 1:
    cost = 20;
    break;
  case 2:
    cost = 30;
    break;
  case 3:
    cost = 50;
    break;
  case 4:
    cost = 70;
    break;
  case 5:
    cost = 120;
    break;
  default:
    console.log("Такої кількості зірок немає");
}
let start = alert("Check for this Hotel with " + stars + " stars " + cost);
